app/views/actas/_form.html.erb

      <%= form.label :expediente, class: 'bmd-label-floating text-secondary' %>
        <%= form.collection_select :expediente_id, Expediente.all, :id,
        :identificador, { include_blank: false}, class: 'form-control rounded' %>
---
SELECT "expedientes".* FROM "expedientes"

        <%= form.label :tipo_de_infraccion, class: 'bmd-label-floating text-secondary' %>
        <%= form.collection_select :tipo_de_infraccion_id, TipoDeInfraccion.all, :id,
        :identificador, { include_blank: true }, class: 'form-control' %>
---
SELECT "tipos_de_infraccion".* FROM "tipos_de_infraccion"