app/views/actas/show.html.erb


      <% if @acta.expediente.present? %>
---
SELECT "expedientes".* FROM "expedientes" WHERE "expedientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


    <% if @acta.descargos.any? %>
---
SELECT 1 AS one FROM "descargos" WHERE "descargos"."acta_id" = $1 LIMIT $2  [["acta_id", 2], ["LIMIT", 1]]