app/controllers/actas_controller.rb

SELECT "actas".* FROM "actas"
---
  def index
    @actas = Acta.all

INSERT INTO "actas" ("numero", "fecha_y_hora", "expediente_id", "created_at", "updated_at", "lugar", "tipo_de_unidad", "tipo_de_servicio", "dominio", "titular", "grupo", "documento", "domicilio", "unidad_retenida", "fecha_de_asociacion") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @acta = Acta.new(acta_params)

    respond_to do |format|
      if @acta.save

UPDATE "actas" SET "tipo_de_servicio" = $1, "titular" = $2, "grupo" = $3, "fecha_de_asociacion" = $4, "updated_at" = $5 WHERE "actas"."id" = $6  [["tipo_de_servicio", "Urbano"], ["titular", "El Cacique S.A"], ["grupo", "Cacique"], ["fecha_de_asociacion", "2019-11-19 19:03:16.726019"], ["updated_at", "2019-11-19 19:03:16.836657"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @acta.update(acta_params)

SELECT "actas".* FROM "actas" WHERE "actas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_acta
    @acta = Acta.find(params[:id])