app/controllers/expedientes_controller.rb

  def index
    @expedientes = Expediente.all
---
SELECT "expedientes".* FROM "expedientes"

  def create
    @expediente = Expediente.new(expediente_params)

    respond_to do |format|
      if @expediente.save
---
INSERT INTO "expedientes" ("identificador", "created_at", "updated_at", "tipo_de_documento", "referencia") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["identificador", "123"], ["created_at", "2019-11-15 18:19:54.467831"], ["updated_at", "2019-11-15 18:19:54.467831"], ["tipo_de_documento", "123"], ["referencia", "123"]]

  def update
    respond_to do |format|
      if @expediente.update(expediente_params)
---
UPDATE "expedientes" SET "updated_at" = $1 WHERE "expedientes"."id" = $2  [["updated_at", "2019-11-15 18:19:54.532622"], ["id", 1]]