app/controllers/tipos_de_infraccion_controller.rb

SELECT "tipos_de_infraccion".* FROM "tipos_de_infraccion"
---
  def index
    @tipos_de_infraccion = TipoDeInfraccion.all